#include "INT.h"


/*****************************************************
*函数名称：void Uart0Mode1_Init(void)
*函数功能：8 位异步模式，波特率：可调(T1/T2)
*入口参数：
*出口参数：
*****************************************************/
void Uart0Mode1_Init(void)
{
    SM00 = 0;
    SM10 = 1;	//模式选择: 模式1
		S0CFG = 0x00;
    REN0 = 1; 	//串行接收使能位
    RI0 = 0;  	//接收中断标志
    TI0 = 0;  	//发送中断标志
    
	//TIMER2 作为uart0的波特率时钟源
    TR2 = 0;
    T2MOD = 0x00;/* 定时2中断不使能，不分频 */
    T2CL = 65536 - 52;
    T2CH = 65536 - 52 >> 8;//波特率：9600
    TL2 = T2CL;
    TH2 = T2CH;
    TR2 = 1;    //启动定时器2
    RCLK = 1;   //接收选择定时器2作为波特率发生器
    TCLK = 1;	  //发送选择定时器2作为波特率发生器
		ES0 = 1;	/* UART0 中断开 */
}
/*****************************************************
*函数名称：void UART0_write(void)
*函数功能：向串口0写一个字节数据
*入口参数：
*出口参数：
*****************************************************/
void UART0_write(int8_t dat)
{
    S0BUF = dat;            //Send data to UART buffer
    while(!TI0);
    TI0 = 0;
}

/*****************************************************
*函数名称：void Int0SetMode0(void)
*函数功能：INT0 中断模式0
*入口参数：
*出口参数：
*****************************************************/
void Int0SetMode0(void)
{
	/*********** INT0 中断模式0 **********/
	IT0CON=0X00|IT_PIN_P04;    //00 Pin---下降沿 ---低电平
//	IT0CON=0X40|INT_PIN;    //10 Pin---上沿   ---高电平
//	IT0CON=0X80|INT_PIN;    //01 Pin---双沿   ---保留（低电平）、
//	IT0CON=0XC0|INT_PIN;    //01 Pin---双沿	  ---保留（低电平）、
	TCON=3;//使能外部中断 0 在输入管脚下降沿时触发
//	TCON=2;//使能外部中断 0 在输入管脚低电平时触发
}
void Int1SetMode0(void)
{
	/*********** INT1 中断模式0 **********/
	IT1CON=0X00|IT_PIN_P04;    //00 Pin---下降沿---
//	IT1CON=0X40|INT_PIN;    //10 Pin---上沿  ---
//	IT1CON=0X80|INT_PIN;    //01 Pin---保留（低电平）、---双沿---
//	IT1CON=0XC0|INT_PIN;    //01 Pin---保留（低电平）、---双沿---
	TCON=0x0c;//外部中断 1 在输入管脚下降沿时触发
//    TCON=0x08;//外部中断 1 在输入管脚低电平时触发
}
/*****************************************************
*函数名称：void Int2SetMode0(void)
*函数功能：INT2 中断模式0
*入口参数：
*出口参数：
*****************************************************/
void Int2SetMode0(void)
{
	/*********** INT2(EP0) 中断模式0 **********/
	EP0CON=0X00|IT_PIN_P05;    //00 Pin---下降沿---
//	EP0CON=0X40|INT_PIN;    //10 Pin---上沿  ---
//	EP0CON=0X80|INT_PIN;    //01 Pin---双沿---
//	EP0CON=0XC0|INT_PIN;    //01 Pin---双沿---
}
























