/*********************************************************
*Copyright (C), 2020-2030, 深圳前海维晟智能技术有限公司
*文件名:	exint1.c
*作  者:	
*版  本:	
*日  期:	
*描  述:	
*备  注:     
**********************************************************/

#include "WS51F6240.h"
static void delay(int i)
{
	long j;
	for(j=0;j<10*i;++j);
}

static void delay_1ms(void)
{
	int j;
	for(j=0;j<1700;++j);
}
/*****************************************************
* 中断服务函数
*****************************************************/
void IT0_isr() interrupt 0
{
	P20=~P20;
}

void IT1_isr() interrupt 2
{
	P20=~P20;
}


void EP0_isr() interrupt 5
{
    if((EPIF&0x01) == 0x01)
    {
        EPIF &= 0xFE;
		P20=~P20;
    }
}

void EP1_isr() interrupt 6
{
    if((EPIF&0x02) == 0x02)
    {
        EPIF &= 0xFD;
		P20=~P20;
    }
}

void EP2_isr() interrupt 7
{
    if((EPIF&0x04) == 0x04)
    {
        EPIF &= 0xFB;
		P20=~P20;
    }
}

void EP3_isr() interrupt 8
{
    if((EPIF&0x08) == 0x08)
    {
        EPIF &= 0xF7;
		P20=~P20;
    }
}

/*****************************************************
*函数名称：void Int0SetMode1(void)
*函数功能：INT0 中断模式1
*入口参数：
*出口参数：
*****************************************************/
void Int0SetMode1(void)
{
	/*********** INT0 中断模式1 **********/
	PIMOD  = 0x01;	//INT0选择模式1
	IT0CON = 0x01;  //选择中断源来自哪组 IO   对应的P0
	P0IMSK = 0x01;	//P0端口外部中断使能寄存器
	P1IMSK = 0x00;  //P1端口外部中断使能寄存器
	P2IMSK = 0x00;	//P3端口外部中断使能寄存器 1111 1111
					//1:当所有的bit位对应IO口状态跟自己设置的IO口状态一致，同一时间出现一个不同自己状态的信号，此时产生中断
					//  如果不是所有的bit位IO状态与自己设置的IO状态一致，其余IO状态改变到不同设置状态时，就不会响应中断
					//0:bit对应的IO口，不作为产生中断的判断口
					//注意：正确使用作为输入时，可触发中断；IO作为输出时，且msk-bit为1，IO输出变化（不同于设定IO状态值）时也是会进入中断
	TCON=2;	//外部中断 0 使能位，1 有效
}

/*****************************************************
*函数名称：void Int1SetMode1(void)
*函数功能：INT1 中断模式1
*入口参数：
*出口参数：
*****************************************************/
void Int1SetMode1(void)
{
	/*********** INT1 中断模式1 **********/
	PIMOD  = 0x02;	//INT1选择模式1
	IT1CON = 0x01;  //选择中断源来自哪组 IO  
	P0IMSK = 0x01;	//P0端口外部中断使能寄存器
	P1IMSK = 0x00;  //P1端口外部中断使能寄存器
	P2IMSK = 0x00;	//P3端口外部中断使能寄存器
					//1:当所有的bit位对应IO口状态跟自己设置的IO口状态一致，同一时间出现一个不同自己状态的信号，此时产生中断
					//  如果不是所有的bit位IO状态与自己设置的IO状态一致，其余IO状态改变到不同设置状态时，就不会响应中断
					//0:bit对应的IO口，不作为产生中断的判断口
					//注意：正确使用作为输入时，可触发中断；IO作为输出时，且msk-bit为1，IO输出变化（不同于设定IO状态值）时也是会进入中断
	TCON=0x08;//外部中断 1 使能位，1 有效
}

/*****************************************************
*函数名称：void Int2SetMode1(void)
*函数功能：INT2 中断模式1
*入口参数：
*出口参数：
*****************************************************/
void Int2SetMode1(void)
{
	/*********** INT2 中断模式1 **********/
	PIMOD  = 0x04;	//INT2选择模式1
	EP0CON = 0x01;  //选择中断源来自哪组 IO  
	P0IMSK = 0x01;	//P0端口外部中断使能寄存器
	P1IMSK = 0x00;  //P1端口外部中断使能寄存器
	P2IMSK = 0x00;	//P3端口外部中断使能寄存器
					//1:当所有的bit位对应IO口状态跟自己设置的IO口状态一致，同一时间出现一个不同自己状态的信号，此时产生中断
					//  如果不是所有的bit位IO状态与自己设置的IO状态一致，其余IO状态改变到不同设置状态时，就不会响应中断
					//0:bit对应的IO口，不作为产生中断的判断口
					//注意：正确使用作为输入时，可触发中断；IO作为输出时，且msk-bit为1，IO输出变化（不同于设定IO状态值）时也是会进入中断
}

/*****************************************************
*函数名称：void Int3SetMode1(void)
*函数功能：INT3 中断模式1
*入口参数：
*出口参数：
*****************************************************/
void Int3SetMode1(void)
{
	/*********** INT3(EP1) 中断模式1 **********/
	PIMOD  = 0x08;	//INT3选择模式1
	EP1CON = 0x01;  //选择中断源来自哪组 IO
	P0IMSK = 0x01;	//P0端口外部中断使能寄存器
	P1IMSK = 0x00;  //P1端口外部中断使能寄存器
	P2IMSK = 0x00;	//P3端口外部中断使能寄存器
					//1:当所有的bit位对应IO口状态跟自己设置的IO口状态一致，同一时间出现一个不同自己状态的信号，此时产生中断
					//  如果不是所有的bit位IO状态与自己设置的IO状态一致，其余IO状态改变到不同设置状态时，就不会响应中断
					//0:bit对应的IO口，不作为产生中断的判断口
					//注意：正确使用作为输入时，可触发中断；IO作为输出时，且msk-bit为1，IO输出变化（不同于设定IO状态值）时也是会进入中断
}

/*****************************************************
*函数名称：void Int4SetMode1(void)
*函数功能：INT4 中断模式1
*入口参数：
*出口参数：
*****************************************************/
void Int4SetMode1(void)
{
	/*********** INT4(EP2) 中断模式1 **********/
	PIMOD  = 0x10;	//INT4选择模式1
	EP2CON = 0x01;  //选择中断源来自哪组 IO
	P0IMSK = 0x01;	//P0端口外部中断使能寄存器
	P1IMSK = 0x00;  //P1端口外部中断使能寄存器
	P2IMSK = 0x00;	//P3端口外部中断使能寄存器
					//1:当所有的bit位对应IO口状态跟自己设置的IO口状态一致，同一时间出现一个不同自己状态的信号，此时产生中断
					//  如果不是所有的bit位IO状态与自己设置的IO状态一致，其余IO状态改变到不同设置状态时，就不会响应中断
					//0:bit对应的IO口，不作为产生中断的判断口
					//注意：正确使用作为输入时，可触发中断；IO作为输出时，且msk-bit为1，IO输出变化（不同于设定IO状态值）时也是会进入中断
}

/*****************************************************
*函数名称：void Int5SetMode1(void)
*函数功能：INT5 中断模式1
*入口参数：
*出口参数：
*****************************************************/
void Int5SetMode1(void)
{
	/*********** INT5(EP3) 中断模式1 **********/
	PIMOD  = 0x20;	//INT5选择模式1
	EP3CON = 0x01;  //选择中断源来自哪组 IO
	P0IMSK = 0x01;	//P0端口外部中断使能寄存器
	P1IMSK = 0x00;  //P1端口外部中断使能寄存器
	P2IMSK = 0x00;	//P3端口外部中断使能寄存器
					//1:当所有的bit位对应IO口状态跟自己设置的IO口状态一致，同一时间出现一个不同自己状态的信号，此时产生中断
					//  如果不是所有的bit位IO状态与自己设置的IO状态一致，其余IO状态改变到不同设置状态时，就不会响应中断
					//0:bit对应的IO口，不作为产生中断的判断口
					//注意：正确使用作为输入时，可触发中断；IO作为输出时，且msk-bit为1，IO输出变化（不同于设定IO状态值）时也是会进入中断
}

/**************************************************************************
功能说明：
1、测试外部中断012345（模式1）
2、模式1中，可选择多组IO端口作为触发中断源，且每组IO端口都可配置掩码PnIMSK；
   因此，模式1，可以任意配置触发端口的个数
3、P10推挽输出，翻转电平；接线：P10接外部中断引脚P00
4、查看中断函数翻转IO脚 P30
**************************************************************************/
void main()
{
    int i;   
    SCCON = 0x00;//HRC
    delay_1ms();
	
	 /*************************管脚配置**********************/  
	   P00F=0x81;	//中断引脚
	   P10F=0x02;	//推挽输出
	   P20F=0X02;	//推挽输出
	
	 /***********************备选中断引脚********************/ 
	   P01F=0x81; 
	   P02F=0x81; 
	   P03F=0x81; 
	   P04F=0x81; 
	   P05F=0x81; 
	   P06F=0x81; 
	   P07F=0x81; 
	
	   P11F=0X81;
	   P12F=0X81;
	   P13F=0X81;
	   P14F=0X81;
	   P15F=0X81;
	   P16F=0X81;
	   P17F=0X81;
	   
	 
	   

		 P0 = 0xff;		//Pn寄存器设置值，外部中断输入口电平与设置的Pn不一致时，触发中断
		 P1 = 0xff;
		 P2 = 0xff;
		 
	 /*************************模式选择**********************/ 
	
	 /********** 中断0模式1 **********/
	Int0SetMode1();//P00端口为中断引脚
	 /********** 中断1模式1 **********/
//	Int1SetMode1();//P00端口为中断引脚
	 /********** 中断2模式1 **********/
//	Int2SetMode1();//P00端口为中断引脚
	 /********** 中断3模式1 **********/
//	Int3SetMode1();//P00端口为中断引脚
	 /********** 中断4模式1 **********/
//	Int4SetMode1();//P00端口为中断引脚
	 /********** 中断5模式1 **********/
//	Int5SetMode1();//P00端口为中断引脚


	 /*********** EP0~EP3 中断使能 ***********/
  EPIE = 0X01;	//EP3~EP0: 3~0	分别对应使能
	
	 EINT5 = 1;		/* EP3 中断使能控制位，用于 ADC/SPI/SCM/EP3 中断 */
	 EINT4 = 1;		/* EP2 使能控制位，用于 UART1/Timer3/EP2 中断 */
	 EINT3 = 1;		/* EP1 用于 Touch Key/WDT/LVD/WKT/EP1 中断 */
	 EINT2 = 1;		/* EP0 用于 IIC/Timer2/PWM/EP0 中断 */ 			
	 EINT1 = 1;		/* INT1 中断 1 使能控制位（中断 1 用于外部中断 1） */
	 EINT0 = 1;		/* INT0 使能控制位（中断 0 用于外部中断 0） */
	 IE  |=  0x80;	//总中断使能


    while(1)
    {		
		//双沿测试        
        P10 = 0;
        P10 = 1; 
        delay(100);
        delay(100);
        delay(100);
        P10 = 0;
        delay(100);
        delay(100);
        delay(100);
        P10 = 1;
        delay(100); 
        delay(100);
        delay(100);       
        P10 = 0;
        i= 5;while(i--)delay(100);
    }
}
