/*********************************************************
*Copyright (C), 2020-2030, 深圳前海维晟智能技术有限公司
*文件名:	buzzer.c
*作  者:	
*版  本:	
*日  期:	
*描  述:	
*备  注:     
**********************************************************/

/*********************************buzzer简介********************************************
WS51F0032 系列芯片有 1 路蜂鸣器驱动输出，可选工作时钟，对该时钟进行 1-64 分频后进行 0-256 
周期和占空比调整。
频率：f=clk/(BZPSC+1)/(BZDIV+1)
*************************************************************************************/
#include "WS51F6240.h"	

static void delay_1ms(void)
{
	int j;
	for(j=0;j<1700;++j);
}

static void delay(int i)
{
	long j;
	for(j=0;j<10*i;++j);
}
/*****************************************************
*函数名称：init_buzzer(void)
*函数功能：buzzer初始化
*入口参数：
*出口参数：
*****************************************************/
void init_buzzer(void)
{
	BZCON = 0+0xc0;	//+0x01/极性选择0, +0x40,+0x80,+0xC0,/时钟选择bit7-6 (0-无，1-LRC，2-LOSC，3-HRC)
	BZPSC = 0;		    //系统时钟预分频配置寄存器，分频倍数为 BZPSC+1
	BZDUT = 50;		  //蜂鸣器驱动高电平所持续的分频时钟个数
	BZDIV = 99;		
}

/**************************************************************
说明：若使用外部时钟则把if 0 变为if 1
***************************************************************/
void main()
{
	  SCCON = 0x00;//HRC
	  HRCON |= 0X80;

#if 0 
/*********************外部losc时钟配置*****************/
	/****************管脚配置	*************/
    P17F = 5;
	P21F = 5;
	
    //使能SCM
    SCMCON = 0x08+0x02; //+0x04
    
    //配置外部时钟使能
    XSCON = 0x08;
    
    //等待外部时钟稳定
    while((XSCON&0x01)==0x0);
		delay_1ms();
	
    //切换系统时钟为外部低速 RC
//	SCCON = 0x40;//LOSC 
#endif
 
	 /*************** 管脚配置 ****************/	
	  P11F = 0X02; 
	  P15F = 2;	//蜂鸣器 管脚

	 /********** 50%占空比的蜂鸣器 ************/
    init_buzzer();
	
	while(1);

}

    
 
    
   
    




