/*********************************************************
*Copyright (C), 2020-2030, 深圳前海维晟智能技术有限公司
*文件名:	timer2.c
*作  者:	
*版  本:	
*日  期:	
*描  述:	
*备  注:     
**********************************************************/
#include "WS51F6240.h"

/* 注:
 * Timer2: 模式选择
 *		(1).重载模式0: 设置 DCEN = 0，CPRL2 = 0，如果 EXEN2 = 1，则 T2EX 边沿和计数溢出时将触发重载，否则只有计数溢出才能触发重载。
 * 		(2).重载模式1: 设置 DCEN = 1，CPRL2 = 0，此时 T2EX 为低时定时器递减计数，T2EX 为高时定时器递增计数。EXF2 标志不再产生中断，而是作为计数器得第 17 位翻转。    
 * 		(3).抓取模式:  设置 CPRL2 = 1， T2CM = 0，T2EX管脚边沿触发抓取; 设置 CPRL2 = 1， T2CM = 1，软件写入寄存器 T2CL 将触发一次抓取操作
 * 		(4).波特率产生器模式:
 * 		(5).时钟输出模式: 设置 T2OE = 1，此时定时器自动进入计数溢出重载模式T2 引脚输出频率为 2 倍溢出周期的时钟。此模式不能使用 T2 作为时钟输入。
 * Timer2: 管脚配置
 *		(1).计数功能, 使用 T2 输入时钟计数, 管脚T2(P11)设置为输入(P11F = 0x1;), T2MOD.2可选上/下沿计数
 * 		(2).时钟输出模式, 管脚T2(P11)设置为输出(P11F = 0x2;)               
 * 		(3).T2EX抓取或触发重载, 管脚T2EX(P12)设置为输入, T2MOD可选上/下沿触发重载或抓取
 */

/*****************************************************
*函数名称：void Timer2OutT(void)
*函数功能：（时钟输出信号）
*入口参数：
*出口参数：
*****************************************************/
void Timer2OutT(void)
{
	/* 定时器2：（时钟输出信号） */
	//重载值：	1  | 2	 | 	3	  | 4	|    5  | 	6    |   7	 | 8
	//输出时钟：8M | 4M  | 2.67M  | 2M  | 1.6M  | 1.33M  |1.14M	 | 1M	
	
	
	//周期	频率		重载值
	//1us   1MHz		8
	//10us  100KHz		80
	//100us 10KHz		800
	//1ms   1KHz		8000
	
//    T2CH = (65536-16000)>>8;
//    T2CL = (65536-16000);	//约1ms方波  0.9917ms
	
	
//    T2CH = (65536-30000)>>8;
//    T2CL = (65536-30000);	//约1.875ms方波

//    T2CH = (65536-16)>>8;
//    T2CL = (65536-16);		//约为1us方波
	
	
//    T2CH = (65536-8)>>8;
//    T2CL = (65536-8);		 //约为0.5us方波
	
    T2CH = 0xff;
    T2CL = 0xff;		//8MHz
	
    TL2 = T2CL;
    TH2 = T2CH;
    
    T2MOD = 2;	 //时钟输出模式,开中断使能,+0x4/T2边沿选择,+0x08/T2EX边沿选择
    T2CON = 0x04;//启动模块,+0x08/T2EX使能,+0x02/计数定时选择,
}

/**************************************************************
说明：P11输出配置时钟
***************************************************************/
void main()
{    
    SCCON = 0x00;//HRC  
    HRCON |= 0x80;	
    
	
    /**************** 管脚配置 ****************/
	  P11F = 0x02; //输出T2时钟
	
	  /************ Timer2 时钟输出 *************/
	  Timer2OutT();
	
    while(1);
}  